package org.mpei.WorkSololearn_17;

public class Practic_1 {
    /**
     * Тестовый вопрос №1:
     */
    volatile boolean isLimited = true;
    /**
     * Отметьте верные утверждения насчёт переменной.
     *
     * Варианты ответа:
     * 1) Изменения переменной сразу видны всем потокам;
     * 2) Изменение isLimited = true безопасно;
     * 3) Изменение isLimited = !isLimited безопасно;
     * 4) Переменную могут читать несколько потоков одновременно;
     * 5) При чтении/записи переменной текущий поток блокируется;
     *
     * Правильный ответ:
     * 1)
     * 2)
     * 4)
     * */
}
